{'docs': '{"_id":"8ead91e8e06f0cee05ce268da632f3dcc631ea3a3a0fe30a952313d68374be1b","_index":".siem-signals-default-000001","logtype":0,"action":"BLOCK","attack":"tcp_syn_flood","dstip":"192.168.10.1","method":"GET","srcip":"192.168.11.2","date":"2022-07-25 13:00:00","@timestamp":"2022-08-02T03:12:45.206Z","event":{"kind":"signal"},"signal":{"_meta":{"version":57},"parents":[{"id":"IY_LTIIBhADKgtyaxPNB","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"ancestors":[{"id":"IY_LTIIBhADKgtyaxPNB","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"status":"open","rule":{"id":"f8278670-1210-11ed-866b-5d15ba915682","actions":[{"group":"default","params":{"body":"{\\r\\n    \\"docs\\":\\"{{context.alerts}}\\",\\r\\n    \\"rule\\":\\"{{rule.type}}\\",\\r\\n    \\"outindex\\":\\"rule00_work_index\\"\\r\\n}"},"actionTypeId":".webhook","actionRef":"action_0"}],"interval":"5s","name":"tanaka_custom_rpxsv_index_rule","tags":[],"enabled":true,"created_by":"elastic","updated_by":"elastic","throttle":null,"created_at":"2022-08-02T03:12:42.132Z","updated_at":"2022-08-02T03:12:43.102Z","description":"tanaka_custom_rpxsv_index_rule","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1000h","kibana_siem_app_url":"https://35.78.85.138:5601/app/security"},"author":[],"false_positives":[],"from":"now-3600005s","rule_id":"a5aa7ab9-2010-4770-986b-42e9dfe32cb5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["tanaka_gs-rpxsv_index"],"query":"action : \\"BLOCK\\"","filters":[]},"reason":"event created low alert tanaka_custom_rpxsv_index_rule.","depth":1,"parent":{"id":"IY_LTIIBhADKgtyaxPNB","type":"event","index":"tanaka_gs-rpxsv_index","depth":0},"original_time":"2022-07-25T03:00:00.000Z"}},{"_id":"c623c2660614f14c331051645d2211336aa20ebee9856c06fcd051b449d76cc2","_index":".siem-signals-default-000001","logtype":0,"action":"BLOCK","attack":"tcp_syn_flood","dstip":"192.168.10.1","method":"GET","srcip":"192.168.11.2","date":"2022-07-25 14:00:00","@timestamp":"2022-08-02T03:12:45.209Z","event":{"kind":"signal"},"signal":{"_meta":{"version":57},"parents":[{"id":"Io_LTIIBhADKgtyaxPO0","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"ancestors":[{"id":"Io_LTIIBhADKgtyaxPO0","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"status":"open","rule":{"id":"f8278670-1210-11ed-866b-5d15ba915682","actions":[{"group":"default","params":{"body":"{\\r\\n    \\"docs\\":\\"{{context.alerts}}\\",\\r\\n    \\"rule\\":\\"{{rule.type}}\\",\\r\\n    \\"outindex\\":\\"rule00_work_index\\"\\r\\n}"},"actionTypeId":".webhook","actionRef":"action_0"}],"interval":"5s","name":"tanaka_custom_rpxsv_index_rule","tags":[],"enabled":true,"created_by":"elastic","updated_by":"elastic","throttle":null,"created_at":"2022-08-02T03:12:42.132Z","updated_at":"2022-08-02T03:12:43.102Z","description":"tanaka_custom_rpxsv_index_rule","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1000h","kibana_siem_app_url":"https://35.78.85.138:5601/app/security"},"author":[],"false_positives":[],"from":"now-3600005s","rule_id":"a5aa7ab9-2010-4770-986b-42e9dfe32cb5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["tanaka_gs-rpxsv_index"],"query":"action : \\"BLOCK\\"","filters":[]},"reason":"event created low alert tanaka_custom_rpxsv_index_rule.","depth":1,"parent":{"id":"Io_LTIIBhADKgtyaxPO0","type":"event","index":"tanaka_gs-rpxsv_index","depth":0},"original_time":"2022-07-25T04:00:00.000Z"}},{"_id":"c460f921949d323a1c5de88d8ced6868865b507f261119f2fcbd5aa1ddc898c4","_index":".siem-signals-default-000001","logtype":0,"action":"BLOCK","attack":"tcp_syn_flood","dstip":"192.168.10.2","method":"GET","srcip":"192.168.11.3","date":"2022-07-25 15:00:00","@timestamp":"2022-08-02T03:12:45.209Z","event":{"kind":"signal"},"signal":{"_meta":{"version":57},"parents":[{"id":"I4_LTIIBhADKgtyaxfMf","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"ancestors":[{"id":"I4_LTIIBhADKgtyaxfMf","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"status":"open","rule":{"id":"f8278670-1210-11ed-866b-5d15ba915682","actions":[{"group":"default","params":{"body":"{\\r\\n    \\"docs\\":\\"{{context.alerts}}\\",\\r\\n    \\"rule\\":\\"{{rule.type}}\\",\\r\\n    \\"outindex\\":\\"rule00_work_index\\"\\r\\n}"},"actionTypeId":".webhook","actionRef":"action_0"}],"interval":"5s","name":"tanaka_custom_rpxsv_index_rule","tags":[],"enabled":true,"created_by":"elastic","updated_by":"elastic","throttle":null,"created_at":"2022-08-02T03:12:42.132Z","updated_at":"2022-08-02T03:12:43.102Z","description":"tanaka_custom_rpxsv_index_rule","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1000h","kibana_siem_app_url":"https://35.78.85.138:5601/app/security"},"author":[],"false_positives":[],"from":"now-3600005s","rule_id":"a5aa7ab9-2010-4770-986b-42e9dfe32cb5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["tanaka_gs-rpxsv_index"],"query":"action : \\"BLOCK\\"","filters":[]},"reason":"event created low alert tanaka_custom_rpxsv_index_rule.","depth":1,"parent":{"id":"I4_LTIIBhADKgtyaxfMf","type":"event","index":"tanaka_gs-rpxsv_index","depth":0},"original_time":"2022-07-25T05:00:00.000Z"}},{"_id":"36ff0b2945deab2f6ff272a0f0ec3a26ad0a725c4bee5e428dd247514f2655c1","_index":".siem-signals-default-000001","logtype":0,"action":"BLOCK","attack":"tcp_syn_flood","dstip":"192.168.10.2","method":"GET","srcip":"192.168.11.3","date":"2022-07-25 16:00:00","@timestamp":"2022-08-02T03:12:45.210Z","event":{"kind":"signal"},"signal":{"_meta":{"version":57},"parents":[{"id":"JI_LTIIBhADKgtyaxfOb","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"ancestors":[{"id":"JI_LTIIBhADKgtyaxfOb","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"status":"open","rule":{"id":"f8278670-1210-11ed-866b-5d15ba915682","actions":[{"group":"default","params":{"body":"{\\r\\n    \\"docs\\":\\"{{context.alerts}}\\",\\r\\n    \\"rule\\":\\"{{rule.type}}\\",\\r\\n    \\"outindex\\":\\"rule00_work_index\\"\\r\\n}"},"actionTypeId":".webhook","actionRef":"action_0"}],"interval":"5s","name":"tanaka_custom_rpxsv_index_rule","tags":[],"enabled":true,"created_by":"elastic","updated_by":"elastic","throttle":null,"created_at":"2022-08-02T03:12:42.132Z","updated_at":"2022-08-02T03:12:43.102Z","description":"tanaka_custom_rpxsv_index_rule","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1000h","kibana_siem_app_url":"https://35.78.85.138:5601/app/security"},"author":[],"false_positives":[],"from":"now-3600005s","rule_id":"a5aa7ab9-2010-4770-986b-42e9dfe32cb5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["tanaka_gs-rpxsv_index"],"query":"action : \\"BLOCK\\"","filters":[]},"reason":"event created low alert tanaka_custom_rpxsv_index_rule.","depth":1,"parent":{"id":"JI_LTIIBhADKgtyaxfOb","type":"event","index":"tanaka_gs-rpxsv_index","depth":0},"original_time":"2022-07-25T06:00:00.000Z"}},{"_id":"a70dd7ee072f3bcb00a93c89271913ae956a7adff6ee93c74a5c51419ea74c70","_index":".siem-signals-default-000001","logtype":0,"action":"BLOCK","attack":"tcp_syn_flood","dstip":"192.168.10.3","method":"GET","srcip":"192.168.11.3","date":"2022-07-25 17:00:00","@timestamp":"2022-08-02T03:12:45.210Z","event":{"kind":"signal"},"signal":{"_meta":{"version":57},"parents":[{"id":"JY_LTIIBhADKgtyaxvMh","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"ancestors":[{"id":"JY_LTIIBhADKgtyaxvMh","type":"event","index":"tanaka_gs-rpxsv_index","depth":0}],"status":"open","rule":{"id":"f8278670-1210-11ed-866b-5d15ba915682","actions":[{"group":"default","params":{"body":"{\\r\\n    \\"docs\\":\\"{{context.alerts}}\\",\\r\\n    \\"rule\\":\\"{{rule.type}}\\",\\r\\n    \\"outindex\\":\\"rule00_work_index\\"\\r\\n}"},"actionTypeId":".webhook","actionRef":"action_0"}],"interval":"5s","name":"tanaka_custom_rpxsv_index_rule","tags":[],"enabled":true,"created_by":"elastic","updated_by":"elastic","throttle":null,"created_at":"2022-08-02T03:12:42.132Z","updated_at":"2022-08-02T03:12:43.102Z","description":"tanaka_custom_rpxsv_index_rule","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1000h","kibana_siem_app_url":"https://35.78.85.138:5601/app/security"},"author":[],"false_positives":[],"from":"now-3600005s","rule_id":"a5aa7ab9-2010-4770-986b-42e9dfe32cb5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["tanaka_gs-rpxsv_index"],"query":"action : \\"BLOCK\\"","filters":[]},"reason":"event created low alert tanaka_custom_rpxsv_index_rule.","depth":1,"parent":{"id":"JY_LTIIBhADKgtyaxvMh","type":"event","index":"tanaka_gs-rpxsv_index","depth":0},"original_time":"2022-07-25T07:00:00.000Z"}}', 'rule': 'siem.signals', 'outindex': 'rule00_work_index'}
